{"responseData": {"feed":{"feedUrl":"http://okajima.air-nifty.com/b/index.rdf","title":"人生を書き換える者すらいた。

","link":"http://o
kajima.air-nifty.com/b/","author":"","description":"ソフトウェア作家兼投機家・岡嶋大介の日

記","type":"rss10","entries":[{"title":"価値の大小を他人と定
量的に議論するには金しかない","link":"http://okajima.air-nifty.com/b/2012/07/post-

8bc4.html","author":"okajima","publishedDate":"Sun, 
15 Jul 2012 06:00:58 -0700","contentSnippet":"　よく、起業は飛行機の離陸に例えられる。滑走路の残りの長さ＝手持ち

資金で、速度を...","content":"\u003cp\u003e　よく、起
業は飛行機の離陸に例えられる。滑走路の残りの長さ＝手持ち資金で、速度を上げながら（＝時間あたりの資金消費量を増

やしながら）進み、手元資金が尽きるまでに離陸できれJばOK、でなければ離陸失敗で事故、というわけだ。\u003cbr\u003e\n
　この例えでは、もし途中で離陸できそうにないと判断した場合は、強引に滑走路を延長する（＝増資）か、離陸できることに賭

けてそのまま突き進むことになる。\u003c/p\u003e\n\n\u003cp\u003e　僕の仕事スタイルは、これでい
くと小型のグライダーだ。滑走路は要らなくて、小高い丘があればいい。よほど条件が悪くない限り離陸はできる。その後も小回り

はきくし、景色もよく見える。でも１人しか乗れないし、速度はジェット機より比較にならないほど小さい。\u003c/p\u00
3e\n\n\u003cp\u003e　この比喩はけっこうよくできている。\u003c/p\u003e\n\n\u003cp\u003e　とくにエンジニアであれば

、「小回りがきく」ことはきわめて重要だ。ちょっと気になるライブラリが出たり、面
白そうな本に出会ったりしたときに、その日の仕事の予定を変更して今興味あるものにとりかかれる自由を確保する、ということだ。

\u003cbr\u003e\n　もちろん重要な締め切り間近とかではそうはいかないが、僕の場合はタイトな期限というのは年
２～３回なので大抵の日は融通が利く。\u003c/p\u003e\n\n\u003cp\u003e　でもサラリーマンではこうはいかない。個人的

興味でフラフラその日のタスクを変えるのは、仮に長期的には何かの役にたつのだとしても、株主の時間と金
を無駄にしていることになる。それがオーナー社長であれば、株主としてだけでなく実務を遂行する上司としての立場からも無駄で

あるのでとうてい受け入れられない。\u003c/p\u003e\n\n\u003cp\u003e　逆に、ある程度大企業にな
れば、興味のあることを手当たり次第やって情報収集するのが任務、というケースもあるだろうけど、中途半端な規模の組織だと

それは難しい。エンジニアとして好きなテーマを選択してそれを仕事にすることを優先するなら、自営でやるか大企業かどっちかだ。

中間
はない。\u003c/p\u003e\n\n\u003cp\u003e　つきつめると、組織で仕事をするとなると、価値観は個人個人でバラバラだか

ら、\u003cb\u003e金銭的効率をもって仕事の価値とする\u003c/b\u003eという
ルールを設けないと収集がつかなくなるというのが真の理由である。何かの価値の大小を他人と「定量的に」議論するとなると、結

局は金以外に基準の置きようがない。\u003c/p\u003e\n\n\u003cp\u003e　僕が人を雇うことを極力避
けてきたのはそこが大きい。自分が忌み嫌ってきた不自由を他人に強制するのはどうしても気持ちのうえで抵抗があるのだ。

\u003cbr\u003e\n\u003c/p\u003e","categories":[]},{"title":"執念深さ"
,"link":"http://okajima.air-nifty.com/b/2012/07/post-75b5.html","author":"okajima","publishedDate":"Thu, 05 Jul 

2012 06:
37:19 -0700","contentSnippet":"　どんな分野でも、成否がアイデアとモチベーションにかかっているような仕事をする

場...","content":"\u003cp\u003e　どんな分野でも、成否がアイデアとモチベ
ーションにかかっているような仕事をする場合、もっとも大事な要素は執念深さだと思うわけです。\u003cbr\u003e\n　少々の

失敗ではたじろがない心がないとやってられないので、手がける分野が好きでないと。いくら失敗しても執念深く継続する
ためには、好きな分野であることは必要条件。\u003c/p\u003e\n\n\u003cp\u003e　ソフトウェアというのは道具なので、何の

ための道具なのかというのが常につきまとう。純粋にコンピュータの世界で閉じているソフトウェアは例え
ばOSとかコンパイラとかVMとか仮想化環境とかだけど、それはソフトウェア全体からみればごくわずかな世界で、ほとんどのソフトウ

ェアは「ソフトウェアの世界に生きていない人」が使うためのものである。\u003c/p\u003e\n\n\u003c
p\u003e　なので、良いソフトウェアを作るためには、そのソフトウェアがターゲットとしている世界もよく知っている必要がある。

\u003cbr\u003e\n　プログラマとして優秀だが会計は素人、という人が会計ソフトウェアを作ってもろくなも
のにならないのは容易に想像できるけれども、実際の世界ではそういうのばかりである。\u003cbr\u003e\n　知らない分野のソフ

トウェアを持ち込まれても機能の良し悪しを判定できないし、ましてや自分でアイデアを思いつくことはできない。同様
にユーザの目からみても、基本的なところから説明しないと要望を伝えられないので無駄が多い。\u003c/p\u003e\n\n

\u003cp\u003e　僕の場合は、トレーディングツール（しかも最初はクライアントサイド）を選択したのはそこが大
きい。自分がよく知っていて、かつ興味ある分野なので、\u003c/p\u003e\n\n\u003cp\u003e * 機能のデザインを他人より（

少なくとも相場を知らない人よりは）よくできる自信があった\u003cbr\u003e\n * 
既存のツールには「つけいる隙」がたくさん見えた\u003cbr\u003e\n * もしデザインに失敗したり、他社に時期的に先行された

りしても、別のアイデアで挽回できそうな気がした\u003cbr\u003e\n * ビジネス面でベストな結
果にならなくても、自信のある分野で勝負して敗れたならそれはそれで満足感はありそう（失敗の理由を、不得意分野で勝負し

たから、としたくはなかった）\u003c/p\u003e\n\n\u003cp\u003e　という要因がこの分野にチャレンジし
た理由である。そしてなにより、\u003cb\u003e「成功・失敗にかかわらずやっていて楽しそう」\u003c/b\u003eなのがポイント

。\u003cbr\u003e\n　大きなプロジェクトをイチからやるには最低３年はかかるので、新し
いことにチャレンジできるのは20～40歳の20年と考えると、チャレンジの回数は多くとも６～７回となる。人生全体で６～７発しか

持っていない弾丸をここで発射できるか？というのは大きな決断をするときにいつも考えることです。\u003c/p\u00
3e\n\n\u003cp\u003e　今日はこのへんで。次はお金の話をしようかと。\u003cbr\u003e\n　あと、今のシリーズは、トレーディ

ングのツールを作るというテーマでは自分の仕事はあと３年かそこらで収束できそうな見通しが立っ
てきたから書いているものです。（もちろんちっとも収束しない可能性もあります）\u003cbr\u003e\n　次は全く新しい分野にチャ

レンジするつもりで、徐々に勉強を開始します。\u003cbr\u003e\n\u003c/p\u003e"
,"categories":[]},{"title":"価値をマーケットに判定してもらう","link":"http://okajima.air-nifty.com/b/2012/07/post-

3788.html","author":"o
kajima","publishedDate":"Sun, 01 Jul 2012 06:12:55 -0700","contentSnippet":"　前回の続きです。 　ソフトウェアの重

要な性質である、 「作るのは大変だけど、価..."
,"content":"\u003cp\u003e　\u003ca href\u003d\"http://okajima.air-nifty.com/b/2012/06/post-8e22.html

\"\u003e前回\u003c/a\u0
03eの続きです。\u003cbr\u003e\n　ソフトウェアの重要な性質である、\u003c/p\u003e\n\n\u003cp\u003e「作るのは大

変だけど、価値のあるソフトウェアが安定稼働しはじめれば膨大な利益を生む」\u003
c/p\u003e\n\n\u003cp\u003e　という状態にどうやってもっていくか？　というのがテーマです。\u003c/p\u003e\n\n

\u003cp\u003e　まず大前提として、\u003cb\u003e価値をマーケットに
判定してもらう\u003c/b\u003eようなものでないとこの状態にはもっていけない。\u003cbr\u003e\n　この対極にあるのが単純

な人月単位の請負仕事で、作る製品が最悪のクソでまったく売上があがらなかったとしても契約の金額はも
らえる（＝損失は発注側がかぶる）一方、大きな利益があっても当初の約束分しかもらえない（＝利益は青天井で発注側のも

のになる）というものである。\u003c/p\u003e\n\n\u003cp\u003e　価値をマーケットに判定してもらうとい
うことは、製作経費も回収できない可能性も相当高いということなので、何の実績もないまま参入するのは無謀である。もとの資

金が最初からその覚悟を負っている場合（VCなど）に比べ、完全に自己資金でやるとなるとリスクはいっそう高い。少なくとも、プロ

ジ
ェクト初期から人をバンバン雇ったり立派なオフィスを構える余裕はない。\u003c/p\u003e\n\n\u003cp\u003e　前回書いた

ように、僕は資質的に経営は無理っぽいのと、他人資本でスタートしたためにたいへんな苦労をしている起業
家を複数知っていた（他人資本だったというだけが苦労の理由ではないけども）ことから、自己資金でスタートするというのは確実

に決めていた。\u003cbr\u003e\n　もっとも独立当時での経験では大した知見はもってなかったけど、\u003cb
\u003e自己資金でスタートして後から情勢によって他人資本を入れるのは可能だけど、逆向きは不可能\u003c/b\u003eとい

うことだけでも自己資金でスタートするには十分な理由である。\u003c/p\u003e\n\n\u003cp\
u003e　さて自己資金で人を雇わずやる場合、どうしても長期戦になる。\u003cbr\u003e\n　仮に自分が並のプログラマーの

３倍の能力があったとして、\u003cbr\u003e\n　\u003ca href\u003d\"http
s://www.google.co.jp/search?q\u003d%E3%82%A6%E3%82%A9%E3%83%BC%E3%82%BA%E3%83%9E

%E3%83%B3%E7%90%86%E8%AB%96\u0026amp;ie\
u003dutf-8\u0026amp;oe\u003dutf-8\u0026amp;aq\u003dt\u0026amp;rls\u003dorg.mozilla:ja:official

\u0026amp;hl\u003dja\u0026
amp;client\u003dfirefox-a\"\u003eウォーズマン理論\u003c/a\u003eを適用した場合でも、素の能力で３倍・長時間労

働で２倍・コミュニケーションによるロスがないことで２倍の効率で12倍のパフォーマンスを
出すのがせいぜいである。\u003cbr\u003e\n　これは純粋に技術面だけの話で、非技術的なことについての能力は自分は凡

人と同等以下だし、長く続けるうちにはモチベーションの下がる時期もあるから、どうみても最初に売り上げがたつまでは最低
１年は無収入で乗り切る必要があるわけだ。\u003c/p\u003e\n\n\u003cp\u003e　当時は独身だったし、相場での収益も

あったので、１年間無収入という金銭面の負担は何とかなりそうだったが、それだけの時間を投入しつづける意欲
が維持できるかどうかはちょっと自信がなかった。\u003c/p\u003e\n\n\u003cp\u003e　そこで最重要だったのが、「好きな分

野のソフトウェアであるかどうか」である。これは本当に重要で、好きなことであるから長くつづけられる
し、いいアイデアを思いつく可能性も高くなるし、そしてなにより、\u003cb\u003e仮に無収入期間が長くなったりプロジェクトの失

敗が見えてきたりした場合でも、精神的に乗り越えられそうな気がしたから\u003c/b\u003eである。\u
003c/p\u003e\n\n\u003cp\u003e　僕の場合はその分野として相場に関するツールを選択したわけです。\u003cbr

\u003e\n　また続きを書きます。\u003c/p\u003e","categories":[]}
,{"title":"ソフトウェア業でどう食っていくか","link":"http://okajima.air-nifty.com/b/2012/06/post-

8e22.html","author":"okajima","publishe
dDate":"Fri, 29 Jun 2012 05:37:30 -0700","contentSnippet":"　ソフトウェア業でどう食っていくかを考えたら、次の３つのコー

スがある。 (1) ...","content":"\u003
cp\u003e　ソフトウェア業でどう食っていくかを考えたら、次の３つのコースがある。\u003c/p\u003e\n\n\u003cp\u003e(1) 既

存の会社の社員になって組織の一員になる\u003cbr\u003e\n(2) (1
)の組織を作って運営する側になる(新規に作るか、昇進を目指す)\u003cbr\u003e\n(3) 組織から距離をおき独自に活動す

る(フリーランスなど)\u003c/p\u003e\n\n\u003cp\u003e　もちろん、この３つに優
劣があるわけではない。どのコースになるかは個人の資質と意志と運で決まる。\u003c/p\u003e\n\n\u003cp\u003e　僕の場

合は(3)を選択しているわけだけど、その目的はやはり「作りたいものを作りたいペースで作る」というの
が最大だ。\u003cbr\u003e\n　サラリーマンだと当然上からの指令で動くわけだけども、自分の意に合わないものを作るときのス

トレスといったら思い出すのもイヤである。その指令が出てくる理由というのも大抵それなりに合理的で、有効な拒否が
できないのがまた嫌らしい。\u003c/p\u003e\n\n\u003cp\u003e　一方、組織を運営する側になるのも、エネルギーの大半を

人間関係の調整に費やすことになるのでちょっとこれは得意分野ではない。技術者出身の経営者というのは自
分のスキルと他人を鼓舞する力の両方に優れているのだろうけど、僕は資質的にそうじゃない。\u003cbr\u003e\n　加えて、従

業員を食わせていくために売り上げを維持しなければならないプレッシャーに耐えるのは相当つらい。特に、全員が頑張ら
ないとその売り上げが維持できない場合には...\u003cbr\u003e\n　これは大学生のときに経験済みだし、サラリーマン時代にも

上司のやっていることを見てこれは自分には無理そうだと思った。\u003c/p\u003e\n\n\u003
cp\u003e　そんな具合で、１～２年位前までは「(1)(2)が無理そうだから」という消極的理由で(3)を選択していた感がある。そう

はいっても収入はサラリーマン時代の数倍になったし、それでもなお、顧客から見れば余所の会社に頼むより費用対効
果は良いものを提供できたと思う。それで家族との時間もたっぷりとれるんだから、これで文句を言ったらバチがあたるというものであ

る。\u003c/p\u003e\n\n\u003cp\u003e　これはモデルとしては漫画家とか映画監督の仕事のスタ
イルに近い。フルに雇うのはごく少数の人数で、本人は作品作りに集中し、他の必要人員はプロジェクト単位の契約で回してい

くというやり方である。「作りたいものを作りたいペースで作る」だけならこのスタイルが最適に近いだろう。\u003c/p\u003
e\n\n\u003cp\u003e　しかし、その方法で自分の実力がわりと世間に通用するらしいことがわかってくると、徐々に飽きてくる。

今の延長をしていくだけでも食うには困らないとわかるとリスクの許容度も上がってくるので、何か冒険をしたくなっ
てくる。何か新しいチャレンジのネタはないかと考えはじめたけれども、僕はソフトウェア以外のことは大して知らないので、ソフトウェ

アの大きな特徴である\u003c/p\u003e\n\n\u003cp\u003e\u003cbr\u003e\n「
最初に作るのは大変だけど、価値のあるソフトウェアが安定稼働しはじめれば膨大な利益を生む」\u003c/p\u003e\n\n

\u003cp\u003e\u003cbr\u003e\nということの本当の意味を真剣に考えた。しかも、今はAWSな
どのおかげでサーバは何台立ててもタダ同然だし、開発ツールも優秀になっているので、個人レベルでも相当戦える時代である。

\u003cbr\u003e\n　そうしているうちにこのメリットを生かして勝負できるプロジェクトが舞い込んできたのでスタート
を決定したのが約１年前のことである。\u003c/p\u003e\n\n\u003cp\u003e　続きは次回。\u003cbr\u003e\n\u003c/p

\u003e","categories":[]}]}}, "responseDe
tails": null, "responseStatus": 200}
